"""
Спільний лічильник
Створіть клас під назвою Counter і зробіть його підкласом класу 
Thread у модулі Threading. Зробіть клас з двома глобальними змінними: 
однією з них буде counter, встановленим на 0, а іншою — rounds, 
встановленим на 100.000. Тепер реалізуйте метод run(), нехай він 
включає простий цикл for, який перебирає раунди (наприклад, 100.000 разів)
і кожного разу збільшує значення лічильника на 1. Створіть 2 екземпляри потоку
та запустіть їх, потім об'єднайте їх і перевірте результат лічильника, він має 
бути 200.000, чи не так? Запустіть його кілька разів і розгляньте різні причини, 
чому ви отримуєте саме таку відповідь. 
"""
import threading

# Лічильник, який буде спільно використовуватись потоками
counter = 0
# Кількість операцій, які виконає кожен потік
ROUNDS = 100_000
# --- Клас Потоку ---
class CounterThread(threading.Thread):
    def run(self):
        global counter
        for _ in range(ROUNDS):
            counter += 1

if __name__ == "__main__":
    print(f"Очікувана кількість збільшень: {2 * ROUNDS:,}")
    print("-" * 40)
    # Створення 2 екземплярів потоку
    thread1 = CounterThread()
    thread2 = CounterThread()
    # Запуск потоків
    thread1.start()
    thread2.start()
# Об'єднання потоків
    thread1.join()
    thread2.join()
# Перевірка остаточного результату лічильника
    print(f"Фактичний результат лічильника: {counter:,}")
    print("-" * 40)
# Різниця
    if counter != 2 * ROUNDS:
        missing = 2 * ROUNDS - counter
        print(f"!!! Відбулася втрата: Втрачено {missing:,} збільшень !!!")
    else:
        print("Очікуваний результат")